{
    "achievement orientation": {
        "Operational Definition": "The drive and passion to achieve one's goals and excel in them.",
        "Potential Strength": {
            "Summary": "Sets ambitious goals and works diligently to achieve them, with high levels of drive and persistence.",
            "Details": [
                "Goes above and beyond what is expected and delivers high-quality work.",
                "Remains committed and focused on one's objectives and avoids getting sidetracked.",
                "Actively tracks down opportunities for professional development and pursues them."
            ]
        },
        "Development Considerations": {
            "Summary": "Has little to no interest in pursuing opportunities for one's professional growth and is content with the status quo.",
            "Details": [
                "Often gets overly focused on the tasks at hand and does not pay adequate attention to the results it is generating.",
                "Tends to set simpler goals and is reluctant to set ambitious goals.",
                "Seldom contributes meaningfully to the team discussions to help raise the bar."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a situation in which you surpassed expectations or accomplished great success. How did you achieve this?",
                "Details": [
                    "Can you provide additional information about the initial expectations? How were they defined?",
                    "What helped you accomplish these remarkable results?",
                    "How did you keep track of your progress? What were your performance metrics?"
                ]
            },
            {
                "Initial": "Can you describe a time when you took advantage of an opportunity that allowed you to develop your skills and achieve better results?",
                "Details": [
                    "Why did you feel the need to sharpen your skills?",
                    "What was the opportunity? Why did you consider it?",
                    "How did it help you achieve better results?"
                ]
            }
        ]
    },
    "adaptability": {
        "Operational Definition": "The ability to make appropriate responses to changed or changing situations, modify or adjust one's behavior in meeting different circumstances or different people.",
        "Potential Strength": {
            "Summary": "Adjusts ones mindset, plans, and behaviors according to new circumstances or challenges",
            "Details": [
                "Adjusts one's mindset and approach to tasks to adapt to the changing environment.",
                "Works well with and collaborates effectively with others from diverse backgrounds.",
                "Stays updated on the industry trends to be better prepared for upcoming or anticipated changes."
            ]
        },
        "Development Considerations": {
            "Summary": "May become overwhelmed by changes and find it difficult to adapt one's behavior to the changing organizational requirements.",
            "Details": [
                "Experiences difficulty adapting to new situations due to focusing on the broader aspects of the change and ignoring the specifics.",
                "Takes longer than usual to adjust one's priorities as one holds on to familiar routines.",
                "Struggles to focus on the positive aspects of change and becomes rigid in one's approach."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about the last time the original plan for a project you worked on had to be altered because of unforeseen events.",
                "Details": [
                    "What was the plan, and why did it have to be altered?",
                    "How did you cope with the changes?",
                    "How did you approach the modification, and what was the outcome?"
                ]
            },
            {
                "Initial": "Has it ever happened that you changed or modified your work priorities to accommodate group expectations?",
                "Details": [
                    "What was the situation, and what was the group's expectation?",
                    "What steps did you take to modify or change your priorities?",
                    "How did it influence the outcome?"
                ]
            }
        ]
    },
    "attention to detail": {
        "Operational Definition": "The ability to actively process specific information in the environment while tuning out other details.",
        "Potential Strength": {
            "Summary": "Demonstrates a strong commitment to quality and completes tasks with precision.",
            "Details": [
                "Often manages to sustain one's focus for long hours while dealing with detailed information.",
                "Takes proactive steps and sets up structures to ensure that details are not overlooked.",
                "Notices gaps in the information and double-checks them to maintain accuracy."
            ]
        },
        "Development Considerations": {
            "Summary": "May overlook pertinent information and struggles to complete tasks accurately.",
            "Details": [
                "Tends to be disorganized and deliver work of varying quality due to rushing through tasks.",
                "Rarely filters out distractions and focuses on the particulars of the task at hand.",
                "May not fully realize the need for accuracy and how it directly impacts the outcomes."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when your attention to detail helped you catch a critical error.",
                "Details": [
                    "What was the situation? What was the error?",
                    "How did you first learn about the error? How did you confirm it?",
                    "How did you rectify the error? What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Describe a time you had to sift through detailed information for work.",
                "Details": [
                    "What was the nature of the information?",
                    "How did you approach this task? What was your biggest challenge?",
                    "if you were to do this again, what would you change?"
                ]
            }
        ]
    },
    "big picture thinking": {
        "Operational Definition": "The ability to come up with ideas, solutions, and opportunities. This also involves seeing possibilities and grabbing opportunities.",
        "Potential Strength": {
            "Summary": "Considers possibilities and emerging trends to identify and capitalize on opportunities.",
            "Details": [
                "Understands the ripple effects of one's decisions by comprehending how different pieces of the system work together.",
                "Masterfully assesses the risks and benefits of each potential opportunity to make informed decisions.",
                "Identifies emerging trends and adapts strategies and approaches to capitalize on potential opportunities."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a narrow focus and struggles to identify potential business opportunities.",
            "Details": [
                "Tends to focus on resolving current issues in isolation without considering their impact on the bigger picture.",
                "Struggles to capitalize on potential opportunities as a result of a limited understanding of how different elements work together.",
                "May often get fixated on the everyday details and lose sight of potential opportunities and possibilities."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you wish you would have considered the broader implications of your decision.",
                "Details": [
                    "What was the situation? What was the decision taken?",
                    "What was the outcome? Why do you think you should have considered the broader implications of your decision?",
                    "Would you change anything if you were to relive this experience?"
                ]
            },
            {
                "Initial": "Describe a time when you seized an opportunity that others may have overlooked.",
                "Details": [
                    "What was the opportunity? How did you notice it?",
                    "Why did you think you should act on this opportunity?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            }
        ]
    },
    "coaching": {
        "Operational Definition": "The ability to extend advice, guidance, and counseling with a focus on an individual's needs and accomplishments, close observation, and impartial and non-judgmental feedback on performance.",
        "Potential Strength": {
            "Summary": "Inspires others to improve their performance by providing timely feedback based on close observation.",
            "Details": [
                "Assists others in reaching their maximum potential by helping them pursue the right learning opportunities.",
                "Co-creates a development plan, evaluates the progress against established goals, and holds others accountable.",
                "Maintains and upholds the utmost levels of professionalism and confidentiality expectations."
            ]
        },
        "Development Considerations": {
            "Summary": "Finds it tough to provide adequate career support to others based on individual-specific requirements.",
            "Details": [
                "Overlooks the importance of collaborative goal setting in helping others advance in their careers.",
                "Has a tendency to deliver feedback subjectively and in a manner that undermines others.",
                "Rarely holds others accountable for their actions and process towards their goals."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about the last time you had to coach somebody on his/her performance.",
                "Details": [
                    "What was the situation?",
                    "How did you give feedback? How did you prepare yourself to give effective feedback? How did you ensure simplicity and comprehension?",
                    "What was the outcome? If you were to redo this, would you change anything?"
                ]
            },
            {
                "Initial": "Share an example of a time when you faced somoeone who seemed unmotivated or lacked commitment.",
                "Details": [
                    "What specific signs or behaviors did you observe that led you to believe they were unmotivated or lacked commitment?",
                    "Did you uncover any underlying reasons or challenges that were contributing to the person's lack of motivation or commitment?",
                    "What strategies or techniques did you use to help the person rekindle their motivation and commitment? Can you provide specific examples of interventions or exercises you employed?"
                ]
            }
        ]
    },
    "collaboration skills": {
        "Operational Definition": "The intent is to collaborate with other members of formal and informal groups in the pursuit of common missions, vision, values, and mutual goals and place team needs and priorities above individual needs.",
        "Potential Strength": {
            "Summary": "Fosters a collaborative environment by encouraging open communication and building strong relationships with team members and stakeholders.",
            "Details": [
                "Resolves conflicts and differences constructively, seeking mutually beneficial solutions.",
                "Promotes open and transparent communication by actively sharing relevant information with team members.",
                "Establishes positive relationships with team members and contributes to the team's development of trust and respect."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a limited comprehension of how one's actions affect the team and its shared goals.",
            "Details": [
                "Is seldom prompt to share information required for the timely completion of tasks and projects.",
                "Prefers working independently and rarely shares ideas and perspectives with team members.",
                "Has difficulty resolving conflicts and disagreements, resulting in strained team relationships."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "When was the last time you found it tough to work in a team setting?",
                "Details": [
                    "Why was it tough to work in a team setting? What were some of the challenges you faced on the team?",
                    "Did you take any measures to work collaboratively with the team?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Give an example of a time you handled a conflict in the team successfully.",
                "Details": [
                    "What was the conflict?",
                    "Why did you decide to help resolve it? What steps did you take?",
                    "What was the outcome? What lessons did you learn from this experience?"
                ]
            }
        ]
    },
    "commercial acumen": {
        "Operational Definition": "The ability to combine experience, knowledge, perspective, and awareness to make sound business decisions while considering a holistic, long-term view of organizational needs.",
        "Potential Strength": {
            "Summary": "Frequently takes a strategic approach to business decisions, ensuring they benefit the organization as a whole.",
            "Details": [
                "Has a thorough understanding of the larger context of one's business and uses it to drive strategic goals.",
                "Regularly evaluates the risks and analyzes the pros over cons to make prudent business decisions.",
                "Is solution-oriented and takes a proactive approach to business challenges to foster organizational success."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a limited understanding of the market dynamics in which the business operates.",
            "Details": [
                "May prefer to make decisions based on intuition or hunch instead of analyzing available data.",
                "May overlook the long-term gains as a result of focusing on the short-term gains.",
                "Struggles to establish strong partnerships that benefit the organization as a whole."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about the last business decision you had to make.",
                "Details": [
                    "What was the decision? Why did you make it?",
                    "What steps did you take before you made this decision? What were the alternatives available to you?",
                    "What did you learn during this process? How would you approach similar decision-making in the future?"
                ]
            },
            {
                "Initial": "Share an instance when you actively contemplated a business decision's long-term consequences.",
                "Details": [
                    "How was the decision made? What were the long-term implications of the decision?",
                    "Were there any risks involved? How did you plan to mitigate them?",
                    "What was the outcome? Did it change the way you approach decision-making?"
                ]
            }
        ]
    },
    "contextualization of knowledge": {
        "Operational Definition": "The process of testing and verification of knowledge to indicate the degree to which the knowledge being developed by the learners is connected to the world beyond the abstractions of the classroom.",
        "Potential Strength": {
            "Summary": "Understands the importance of being able to apply one's knowledge to various real-life problems.",
            "Details": [
                "Actively looks for resources like recent industry reports and uses case studies to improve one's understanding.",
                "Explores the commercial or practical implications of ones knowledge through discussions and projects.",
                "Skillfully adapts the theoretical knowledge and insights one has gained to a variety of situations."
            ]
        },
        "Development Considerations": {
            "Summary": "Needs to work on bridging the gap between theory and practice and focus on applicability to real-world problems.",
            "Details": [
                "Struggles to adapt or apply theoretical knowledge to various contexts effectively.",
                "Experiences difficulty considering the practical implications of what one has learned.",
                "May demonstrate little to no creativity and innovation when solving problems or making decisions at work."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you successfully applied theoretical knowledge to a real-world problem.",
                "Details": [
                    "What was the situation?",
                    "How did you adapt your understanding to address the specific challenges and constraints of the situation?",
                    "What was the outcome?"
                ]
            },
            {
                "Initial": "Tell us about a time when you applied your knowledge or expertise to a new and unfamiliar situation.",
                "Details": [
                    "How did you contextualize your knowledge?",
                    "What steps did you take to ensure its effectiveness in that context?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            }
        ]
    },
    "courage and risk-taking": {
        "Operational Definition": "The ability to face one's fears and try something different and intimidating by developing and stretching one's mindset and embracing challenges.",
        "Potential Strength": {
            "Summary": "Believes in oneself and one's abilities, and acts with fortitude despite ambiguity or roadblocks.",
            "Details": [
                "Takes calculated risks to investigate possibilities and pursue creative ideas.",
                "Accepts challenging tasks as a result of viewing roadblocks as growth opportunities.",
                "Takes full responsibility for one's decisions and learns from setbacks or errors."
            ]
        },
        "Development Considerations": {
            "Summary": "Prefers to stick to tried and tested methods and shows a tendency to play it safe and maintain the status quo.",
            "Details": [
                "Has a tendency to attribute responsibility for the outcomes of one's decisions to external factors or influences.",
                "May overemphasize possible adverse consequences rather than potential positive outcomes.",
                "Has difficulty recuperating from setbacks, which inhibits risk-taking in the future."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you displayed courage and took calculated risk-taking at work.",
                "Details": [
                    "What was the situation? What pushed you to take the calculated risk?",
                    "How did you weigh the benefits against the risks before making your choice? What steps did you take to reduce the risks of your decision?",
                    "What was the result? How did this change your approach to risk-taking at work?"
                ]
            },
            {
                "Initial": "Describe a time when you voluntarily took on a challenging task or project.",
                "Details": [
                    "Why was the task challenging? Why did you decide to volunteer?",
                    "Did you face any unexpected challenges? How did you handle those?",
                    "What did you learn from this experience about stepping out of your comfort zone?"
                ]
            }
        ]
    },
    "creative problem solving": {
        "Operational Definition": "The ability to identify and analyze problems; weigh the relevance and accuracy of information; \ngenerate and evaluate alternative solutions; and make recommendations.",
        "Potential Strength": {
            "Summary": "Formulates rational and innovative ideas harnessing available resources.",
            "Details": [
                "Exhibits creativity in generating viable solutions and enlists the associated potential outcomes.",
                "Assesses the relevance and accuracy of information using analytical skills, and uncovers missing information.",
                "Offers actionable solutions with minimal risk by contemplating their broader impact to achieve desired results."
            ]
        },
        "Development Considerations": {
            "Summary": "Tries to force-fit solutions and relies on conventional problem-solving methods.",
            "Details": [
                "Typically finds it tough to define problems accurately, and focuses more on the symptoms.",
                "Exhibits a tendency to rely on available or provided information without evaluating its accuracy.",
                "Rarely looks for alternative solutions or considers ways to mitigate potential risks."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you had to use unconventional methods to solve a challenging or complex problem.",
                "Details": [
                    "What was the problem? Why was it so hard to solve using conventional methods?",
                    "What unconventional approaches did you consider? How did you come up with them?",
                    "Did this experience change your perspective on problem-solving or encourage you to explore more unconventional approaches in the future?"
                ]
            },
            {
                "Initial": "Explain a time when you recommended a creative solution to a problem.",
                "Details": [
                    "What was the problem? What was the solution?",
                    "How did you come up with a creative solution? Did you find ways to mitigate risks? Did you see any resistance to your solution?",
                    "Did the solution achieve the desired results? Why or why not?"
                ]
            }
        ]
    },
    "critical thinking": {
        "Operational Definition": "The ability to solve a problem by recognizing assumptions, evaluating the arguments, and then drawing conclusions about the problem.",
        "Potential Strength": {
            "Summary": "Considers alternative perspectives and approaches to the problem before reaching a conclusion.",
            "Details": [
                "Clarifies information and challenges information by asking probing questions to draw conclusions.",
                "Draws well-supported and accurate conclusions by employing evidence-based thinking.",
                "Can adapt one's approach in light of new information."
            ]
        },
        "Development Considerations": {
            "Summary": "May jump to conclusions without fully evaluating evidence or considering different perspectives.",
            "Details": [
                "Tends to avoid seeking clarity on the available information by asking probing questions.",
                "Is often resistant to altering one's perspective or thought processes upon arriving at the conclusion.",
                "Experiences difficulty in evaluating arguments or situations for the presence of logical fallacies or errors."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Can you provide an example of a situation where you had to anticipate potential obstacles or risks before implementing a solution?",
                "Details": [
                    "How did you plan ahead and mitigate those risks?",
                    "What techniques or tools did you use to analyze and evaluate the likelihood and severity of the anticipated obstacles or risks?",
                    "What was the final outcome of implementing the solution? Were the anticipated obstacles or risks successfully mitigated or managed?"
                ]
            },
            {
                "Initial": "When was the last time you questioned the validity of an argument or challenged an assumption?",
                "Details": [
                    "What was the argument or the assumption?",
                    "Why did you feel the need to question it? What steps did you take? Did you try to convince others that there's an error?",
                    "What was the outcome? What did you learn from the situation?"
                ]
            }
        ]
    },
    "dealing with uncertainty": {
        "Operational Definition": "The ability to adapt and cope constructively with unprecedented situations or events.",
        "Potential Strength": {
            "Summary": "Functions competently despite limited information or uncertain outcomes.",
            "Details": [
                "Recognizes and deals with issues and hurdles in an uncertain environment.",
                "Makes decisions based on the thorough analysis of available information.",
                "Maintains composure and focuses on maintaining productivity during unprecedented situations."
            ]
        },
        "Development Considerations": {
            "Summary": "Tends to be indecisive due to the lack of clear information in the face of unprecedented situations.",
            "Details": [
                "May get overwhelmed and rely heavily on others when faced with unprecedented or novel situations to cope with them.",
                "Finds it tough to be optimistic and is less likely to take active steps to cope constructively with unprecedented situations.",
                "Needs to work on communicating one's perspective clearly to avoid confusion and misunderstanding."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time you had difficulty adjusting to an uncertain situation.",
                "Details": [
                    "What was the situation, and how did you adapt to it?",
                    "What was the outcome? Why do you think it was not the best way to deal with it?",
                    "If you were to do it again, what would you do differently?"
                ]
            },
            {
                "Initial": "When was the last time you were happy with how you handled your emotions and stress levels in the face of an unanticipated situation?",
                "Details": [
                    "What was the situation? What made this situation unanticipated?",
                    "What did you do to manage your emotions or stress levels during this situation?",
                    "How did it influence the outcome? If you were to do it again, would you change anything?"
                ]
            }
        ]
    },
    "developing others": {
        "Operational Definition": "The ability to share one's knowledge, skills, or expertise with others, and encourage and reinforce individual and professional development through support, recognition, and motivation.",
        "Potential Strength": {
            "Summary": "Is committed to providing adequate support and direction to others to aid in their professional development.",
            "Details": [
                "Acknowledges and nurtures individual strengths and encourages them to reach their full potential.",
                "Offers opportunities for others to learn from their mistakes.",
                "Assumes responsibility for fostering an atmosphere that promotes individual development."
            ]
        },
        "Development Considerations": {
            "Summary": "Has little to no interest in sharing one's knowledge or expertise with others to aid in their professional development.",
            "Details": [
                "Find it tough to provide opportunities for others to hone their skill set and reach their full potential.",
                "Rarely engages in productive feedback sessions when working with others.",
                "May not actively foster an environment conducive to professional growth."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you delegated a challenging task to someone to help them grow and develop.",
                "Details": [
                    "How did you assess the skills and capabilities of the individual to determine their readiness for the task?",
                    "How did you communicate expectations and provide clear guidelines for the task?",
                    "How did you provide feedback and recognition to the individual upon completion of the task?"
                ]
            },
            {
                "Initial": "Describe a time when you supported someone in acquiring a new skill.",
                "Details": [
                    "What was the new skill?",
                    "How did you provide support? Did you track their progress?",
                    "What did this experience teach you about yourself? Could you have supported them in a better manner? If yes, how?"
                ]
            }
        ]
    },
    "driving change and innovation": {
        "Operational Definition": "The ability to bring in radical or incremental shifts or improvements and introduce and implement new ideas.",
        "Potential Strength": {
            "Summary": "Actively challenges the status quo by identifying opportunities for change and implementing it.",
            "Details": [
                "Quickly adapting one's approach in response to changing conditions by thinking creatively.",
                "Knows how to persuade stakeholders to gain support for pursuing innovative ideas.",
                "Ensures that innovative and creative ideas are put into actionable plans."
            ]
        },
        "Development Considerations": {
            "Summary": "Tends to accept the status quo without challenging or assessing the possibility of change.",
            "Details": [
                "Is inflexible and may stick to a predetermined course of action.",
                "Experiences difficulty in gaining others' support as a result of not effectively communicating the value of change.",
                "Has a limited understanding of how to assess the impact of change."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you introduced and implemented a new idea or process to improve the status quo.",
                "Details": [
                    "What was the proposed idea or procedure, and what was the underlying reason?",
                    "Did you face any particular difficulties or obstacles? Were you able to gain stakeholder support? How?",
                    "What was the outcome? In the future, how would you approach similar situations?"
                ]
            },
            {
                "Initial": "Give an instance in which you persuaded others to embrace change at work.",
                "Details": [
                    "How did you convince others to adopt the change?",
                    "How did you convey the benefits and implications of the change?",
                    "What was the outcome? In the future, how would you approach similar situations?"
                ]
            }
        ]
    },
    "empathetic": {
        "Operational Definition": "The ability to sense others' feelings and genuinely seek to understand and respect others' perspectives and emotions.",
        "Potential Strength": {
            "Summary": "Exhibits genuine care and concern for others' perspectives, emotions, and general well-being.",
            "Details": [
                "Can effectively use both verbal and nonverbal clues to show support and understanding.",
                "Tends to use a positive tone and language and helps others to accomplish their assigned responsibilities.",
                "Asks queries to confirm one's understanding and responds appropriately."
            ]
        },
        "Development Considerations": {
            "Summary": "Lacks the motivation to show concern for the perspectives, emotions, and well-being of others.",
            "Details": [
                "May struggle to build rapport with others as a result of prioritizing one's needs and emotions.",
                "Tends to offer support or help to others only when asked.",
                "Experiences difficulty understanding how one's words and actions may affect others' emotions."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you provided support or assistance to a team member or colleague who was facing personal or professional challenges.",
                "Details": [
                    "What were the specific challenges or difficulties the person was experiencing?",
                    "Can you provide examples of actions or resources you provided to help the person?",
                    "Did the person's situation improve or change as a result of your empathy and assistance?"
                ]
            },
            {
                "Initial": "Give an example of a time when someone approached you with their problems or concerns.",
                "Details": [
                    "As they approached you, what did you do? Were you willing to listen to their concerns?",
                    "What steps did you take to actively listen to this person? Did you ask questions? After the first conversation, did you follow up?",
                    "What did you learn about yourself from this? What would you do differently if you had to do this again?"
                ]
            }
        ]
    },
    "empowering others": {
        "Operational Definition": "The ability to convey confidence in employees' ability to be successful, especially at challenging, new tasks; delegating significant responsibility and authority; allowing employees' freedom to decide how they will accomplish their goals and resolve issues.",
        "Potential Strength": {
            "Summary": "Inspires confidence in others by acknowledging others' talents and potential for success.",
            "Details": [
                "Regularly offers learning opportunities to support others' professional development.",
                "Gives constructive feedback and encouragement to help them enhance their skills set.",
                "Equips others for success by allocating the necessary resources."
            ]
        },
        "Development Considerations": {
            "Summary": "May find it difficult to provide others with the resources and feedback necessary to inspire self-confidence.",
            "Details": [
                "May become deeply involved in every element of a task and curtail others' ability to make decisions.",
                "Demonstrates a lack of willingness to trust others with major responsibility and power.",
                "Rarely recognizes and honors the achievements and efforts of others in accomplishing results."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time when you made it possible for others to stretch their abilities.",
                "Details": [
                    "What was the nature of the opportunities that you created for others? How did you encourage others to try new things?",
                    "How did these opportunities help other people? Did you give them feedback or helpful advice as they dealt with the new challenges? Did you provide any recognition to them?",
                    "What did you learn from this experience in terms of facilitating and fostering the growth of others' abilities?"
                ]
            },
            {
                "Initial": "Describe a time when you empowered an employee to take on a difficult assignment.",
                "Details": [
                    "What was the task? How did you figure out that this person could do the job?",
                    "How did you empower this person to take on this assignment? What steps did you take? How did you deal with their concerns?",
                    "What did you take away from this experience? What would you do differently if you could do it again?"
                ]
            }
        ]
    },
    "energy, passion, and optimism": {
        "Operational Definition": "The attitude to take a proactive perspective and harness shifting of one's perspective with a sense of passion and hope that the outcome of some specific endeavor would be favorable.",
        "Potential Strength": {
            "Summary": "Displays enthusiasm for one's work by effectively allocating one's energy across multiple tasks based on their requirements.",
            "Details": [
                "Recuperates effectively and maintains productivity at work for an extended period of time.",
                "Maintains an unwavering focus on the desirable outcomes and channels one's energy and enthusiasm towards achieving them.",
                "Maintains an optimistic and cheerful attitude regardless of difficult conditions, thereby fostering fortitude and determination."
            ]
        },
        "Development Considerations": {
            "Summary": "May lack the motivation and drive to act on one's ambitions and aspirations.",
            "Details": [
                "Finds it difficult to manage one's energy levels to complete multiple tasks on a daily basis.",
                "May at times lose hope while dealing with pressure or unforeseen obstacles.",
                "May postpone tasks and responsibilities due to a lack of belief in their potential benefits."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time you found yourself losing your motivation and enthusiasm regarding a task.",
                "Details": [
                    "What was the situation? What were some of the challenges you were facing?",
                    "What measures did you take to sustain your motivation and enthusiasm?",
                    "What lessons did you take away from this experience?"
                ]
            },
            {
                "Initial": "Can you share a time when your energy and enthusiasm made an impact on the outcome?",
                "Details": [
                    "What was the task? What was the outcome?",
                    "What acts or behaviors demonstrated your excitement and contributed to the outcome?",
                    "What did you take away from this experience?"
                ]
            }
        ]
    },
    "exploring perspectives and alternatives": {
        "Operational Definition": "The ability to evaluate and work towards problems with an openness to experience and consideration towards different perspectives and alternatives.",
        "Potential Strength": {
            "Summary": "Considers the broader picture and the interconnectedness of things while evaluating alternatives.",
            "Details": [
                "Understands that there can be multiple ways of getting things done right.",
                "Deliberately searches for new points of view and opinions while tackling problems.",
                "Has the flexibility to modify one's perspective based on new information or insights."
            ]
        },
        "Development Considerations": {
            "Summary": "Often disregards alternative viewpoints without evaluating their potential value.",
            "Details": [
                "Tends to adhere to the predetermined way of resolving a problem, even in the face of appealing options.",
                "Is hesitant to participate in discussions that challenge ones own beliefs and approaches.",
                "Possesses a rudimentary grasp of the potential benefits and drawbacks linked to the presented options."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Share an instance when you changed your approach to a problem in light of a better alternative.",
                "Details": [
                    "What problem were you trying to solve?",
                    "How did you learn about the better alternative? What made you decide to change the way you do things?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Provide an example of a time you explored and found multiple solutions to a problem.",
                "Details": [
                    "What specific problem were you trying to resolve?",
                    "What inspired you to seek out alternate solutions? How did you assess the various solutions you discovered?",
                    "What did you finally decide? What did you learn from this experience?"
                ]
            }
        ]
    },
    "fostering inclusiveness": {
        "Operational Definition": "The act or practice of including and accommodating people irrespective of their race, gender, sexuality, or ability.",
        "Potential Strength": {
            "Summary": "Actively promotes an environment in which people from diverse backgrounds can work collaboratively.",
            "Details": [
                "Strives to provide equal opportunities for everyone to contribute during discussions.",
                "Consistently practices self-reflection to gain understanding and rectify any biased behavior to promote collaboration.",
                "Maintains a courteous and deferential demeanor when interacting with people from various backgrounds."
            ]
        },
        "Development Considerations": {
            "Summary": "May lack the motivation to actively foster an inclusive environment for all people despite their backgrounds.",
            "Details": [
                "Shows a limited understanding of the problems and issues experienced by people from different backgrounds.",
                "May occasionally tolerate behavior that encourages exclusion.",
                "Finds it challenging to reflect and pinpoint instances of prejudices or biases in one's behavior."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when it was hard for you to get a group of different people to work together.",
                "Details": [
                    "What were some of the differences that existed within the group?",
                    "What steps did you take to try to bring the group together? What was the outcome?",
                    "What did you learn about bringing together different groups of people from this?"
                ]
            },
            {
                "Initial": "Tell us about a time when you successfully adapted to a different culture.",
                "Details": [
                    "What cultural difference did you face? How did this new culture challenge you?",
                    "How did you deal with the cultural differences? What steps did you take to accept the new culture?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            }
        ]
    },
    "grit and persistence": {
        "Operational Definition": "The ability to demonstrate passion and perseverance for long-term meaningful goals and work towards overcoming any challenges in the process.",
        "Potential Strength": {
            "Summary": "Tenaciously pursues long-term objectives while under pressure, even when the alternatives seem more appealing.",
            "Details": [
                "Maintains focus, exerts consistent effort, and takes calculated risks to attain long-term goals.",
                "Proactively removes obstacles and adjusts one's approach periodically to achieve one's long-term goals.",
                "Continuously pushes forward by bouncing back quickly from setbacks and not giving up easily."
            ]
        },
        "Development Considerations": {
            "Summary": "Finds it difficult to maintain one's motivation to achieve long-term goals, specifically in the face of obstacles or setbacks.",
            "Details": [
                "Experiences difficulty establishing contingency measures and adapting one's approach when met with challenges.",
                "Exhibits a tendency to give up on tasks as a result of focusing on negative experiences.",
                "Has difficulty recovering from setbacks as a result of getting easily discouraged."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe one of your long-term goals and the steps you have taken so far to achieve it.",
                "Details": [
                    "Why is this goal important for you?",
                    "What are some of the hurdles you have had to overcome so far?",
                    "Are there chances of you swaying from this goal? Why or why not?"
                ]
            },
            {
                "Initial": "When was the last time circumstances made you forsake a long-term goal?",
                "Details": [
                    "What was the long-term goal?",
                    "Why did you abandon the long-term goal? Did you consider any alternatives before forsaking the long-term goal?",
                    "Do you believe it was the right decision? Why do you think so?"
                ]
            }
        ]
    },
    "instilling trust": {
        "Operational Definition": "The intent is to gain the confidence and trust of others through honesty, integrity, and authenticity.",
        "Potential Strength": {
            "Summary": "Has earned the credibility and trust of others by delivering on promises and meeting expectations on a consistent basis.",
            "Details": [
                "Ensures that one's actions and words are congruent to build trust with others.",
                "Makes decisions based on strong ethical convictions and consideration of the impact on others.",
                "Conforms to moral and ethical standards and principles set by the organization."
            ]
        },
        "Development Considerations": {
            "Summary": "May have less regard for others' perspectives that impacts trust in the process.",
            "Details": [
                "Exhibits a disconnect between expressed values and actual behavior.",
                "Tends to be evasive, which in turn, invites others' skepticism.",
                "Struggles to deliver on one's promises and commitments on time."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when your honesty and integrity helped you earn the trust of others.",
                "Details": [
                    "What was the situation?",
                    "How did you ensure that your approach was honest? How did you handle the potential consequences? How did you demonstrate your honesty and integrity?",
                    "What have you gained from this experience?"
                ]
            },
            {
                "Initial": "Tell me about a time when you had to regain trust after a breakdown or mistake.",
                "Details": [
                    "How did you approach the situation, and what actions did you take to rebuild trust?",
                    "How did you take responsibility for the situation and acknowledge the impact it had on trust?",
                    "What indicators or feedback did you receive that indicated trust was being regained?"
                ]
            }
        ]
    },
    "learnability": {
        "Operational Definition": "The ability to learn something new and apply learnings from one's experiences in new ways to adapt to situations.",
        "Potential Strength": {
            "Summary": "Regularly upskills and applies newly acquired knowledge at work to adapt to work situations.",
            "Details": [
                "Pays adequate attention to the feedback received and finds ways to incorporate it into one's work.",
                "Tends to see setbacks as learning opportunities and uses those insights to improve one's productivity.",
                "Is resourceful and takes ownership of one's professional development."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a hard time taking responsibility for one's learning due to a limited understanding of ones areas of improvement.",
            "Details": [
                "Experiences difficulty recognizing clear and specific learning objectives that are pertinent to one's long-term career goals.",
                "Has difficulty incorporating feedback and other insights into practice to improve one's skills and performance.",
                "Do not see a need to build a supportive learning network of industry experts and other resources related to one's area of work."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you needed to learn something new to complete a task.",
                "Details": [
                    "What was the task? What new skill did you need to learn to complete it?",
                    "How did you approach it? Did you face any difficulties?",
                    "What have you gained from this experience?"
                ]
            },
            {
                "Initial": "When was the last time it was extremely challenging for you to learn new skills required for your job?",
                "Details": [
                    "What was the skill in question? Why was it difficult to learn?",
                    "How did you approach the situation? What steps did you take?",
                    "Did you succeed? What was the outcome?"
                ]
            }
        ]
    },
    "motivating and inspiring others": {
        "Operational Definition": "The ability to motivate and guide people to get the job done, and to bring out their best.",
        "Potential Strength": {
            "Summary": "Creates an environment where team members feel valued and supported.",
            "Details": [
                "Acknowledges the efforts of others and provides recognition to bring out the best in others.",
                "Actively works with others to set meaningful goals to motivate them.",
                "Provides guidance, support, and challenging opportunities to team members to expand their skills, take on new responsibilities, and achieve their full potential."
            ]
        },
        "Development Considerations": {
            "Summary": "Less oftent inspire or ignite enthusiasm in others, leading to a lack of motivation within the team or organization.",
            "Details": [
                "Finds difficulty in articulating goals, providing feedback, or conveying a sense of purpose, resulting in diminished motivation and inspiration.",
                "May struggle establishing meaningful relationships, understanding individual needs, and building trust.",
                "May overlook providing the necessary resources, guidance, or mentorship to help others grow and excel in their roles."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time you had to motivate your team through a series of setbacks.",
                "Details": [
                    "What was the nature of the setbacks? How did you motivate the team?",
                    "Did you offer any additional help or resources? Did you ask the team what they needed?",
                    "What was the team's response? What was the outcome? What could you have done better?"
                ]
            },
            {
                "Initial": "Describe a time when you inspired your team members to achieve a difficult goal.",
                "Details": [
                    "What was your team's challenging goal?",
                    "How did you motivate team members? How did you handle the obstacles and keep the team going?",
                    "What was the outcome? What did you take away from the experience?"
                ]
            }
        ]
    },
    "negotiation and persuasion": {
        "Operational Definition": "The ability to gain support and cooperation from others to achieve a desired course of action consistent with the organizations strategic goals and objectives.",
        "Potential Strength": {
            "Summary": "Often asserts one's position with confidence while remaining open to other points of view.",
            "Details": [
                "Utilizes the arguments made by others to put together one's own convincing case.",
                "Recognizes when to end negotiations and reach an agreement for the best results.",
                "Maintains professionalism and composure even in difficult or high-stakes negotiations."
            ]
        },
        "Development Considerations": {
            "Summary": "Finds it tough to articulate ones position or proposals during negotiations.",
            "Details": [
                "Tends to rely on emotional appeals or opinions rather than evidence-based arguments.",
                "Experiences difficulty establishing trust and rapport with others to lay the groundwork for successful negotiation.",
                "Displays rigidity and may find it tough to adapt to unforeseen challenges that arise during negotiations."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a negotiation that did not go as you had hoped.",
                "Details": [
                    "What was the negotiation about, and who was involved?",
                    "What problems did you face during this negotiation? How did you handle them?",
                    "What could you have done differently? What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Describe a situation in which you had to negotiate with a challenging or resistant stakeholder.",
                "Details": [
                    "What was the negotiation about? What did the stakeholders want?",
                    "How did you approach the negotiations? What were the objections raised by the stakeholder? Did you consider any compromises?",
                    "What was the outcome? What lessons did you learn from this?"
                ]
            }
        ]
    },
    "openness to feedback": {
        "Operational Definition": "The extent to which one is open to feedback from others, handles criticism in a positive and constructive manner, and focuses on improving one's performance based on the feedback.",
        "Potential Strength": {
            "Summary": "Actively listens to feedback and seeks to understand the perspectives and insights shared.",
            "Details": [
                "Seeks feedback that is specific and actionable and provides direction for improvement.",
                "Takes the initiative to make improvements in response to feedback.",
                "Acknowledges that feedback is a continuous process and routinely gathers feedback."
            ]
        },
        "Development Considerations": {
            "Summary": "Is dismissive of the feedback received and views it as a threat.",
            "Details": [
                "Frequently reacts strongly or impulsively to feedback without contemplating its validity.",
                "May reluctantly make selective changes or alterations based on feedback received.",
                "Tends to avoid asking for feedback or the opinion of others to prevent potential critique."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you actively sought feedback to improve your performance.",
                "Details": [
                    "What drove you to seek feedback? How did you go about getting feedback?",
                    "What was the response you got? How did you respond to the feedback?",
                    "What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Explain a situation where you took concrete steps to implement the feedback received.",
                "Details": [
                    "Who provided the feedback, and what was it about?",
                    "How did you implement the feedback? Did you face any obstacles?",
                    "What was the outcome? Do you see feedback differently now?"
                ]
            }
        ]
    },
    "organizational awareness": {
        "Operational Definition": "The ability to appreciate and use formal and informal relationships and structures for the benefit of the organization.",
        "Potential Strength": {
            "Summary": "Acknowledges the formal and informal organizational power structures, such as hierarchies and influential networks.",
            "Details": [
                "Can identify the main decision-makers and their objectives and viewpoints within the organization.",
                "Actively seeks out and accumulates pertinent information about the organization, including competitive landscape and internal changes.",
                "Manages internal conflicts and problems in a manner that maintains healthy working relationships."
            ]
        },
        "Development Considerations": {
            "Summary": "Has difficulty navigating and leveraging the organization's formal and informal power structures.",
            "Details": [
                "Finds it tough to develop networks of acquaintances within the organization.",
                "May lack the motivation to maintain awareness of the organization's strategic objectives and priorities.",
                "Finds it hard to keep up with changes in the organization which could result in missed opportunities."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time when you utilized an existing relationship to accomplish an organizational objective.",
                "Details": [
                    "What was the goal you were trying to achieve?",
                    "What connection did you leverage? What kind of help did you ask for? How did you use the connection to achieve the goal?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Tell us about a work project you promoted using official and informal means.",
                "Details": [
                    "What was the project? Why did it have to be promoted?",
                    "What steps did you take to promote it? What challenges did you face during the promotion?",
                    "What was the outcome? If you were to do this again, would you change anything?"
                ]
            }
        ]
    },
    "ownership and accountability": {
        "Operational Definition": "The sense of possession and responsibility for one's own actions and their impact.",
        "Potential Strength": {
            "Summary": "Assumes full responsibility for one's work and takes corrective actions whenever required.",
            "Details": [
                "Has a track record of meeting deadlines and timely delivers on one's work commitments.",
                "Regularly complies with organizational policies and fosters a culture of ownership.",
                "Focuses on finding solutions to problems rather than assigning blame."
            ]
        },
        "Development Considerations": {
            "Summary": "May hesitate to embrace personal responsibility for one's actions due to a lack of commitment.",
            "Details": [
                "Rarely demonstrates a sense of urgency to complete tasks in a timely manner.",
                "Tends to be defensive and may try to place the responsibility on others instead of taking corrective action.",
                "Has some difficulty recovering from setbacks, resulting in lost opportunities for personal development and growth."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Can you give an example of a time when you had to take accountability for a team's failure or underperformance?",
                "Details": [
                    "How did you handle the situation, and what actions did you take to address the issue?",
                    "How did you ensure that team members understood their individual roles and responsibilities in overcoming the failure or underperformance?",
                    "What were the outcomes or results of your efforts to rectify the situation? Did the team's performance improve, and if so, how was it measured?"
                ]
            },
            {
                "Initial": "Give an example of a time when you took responsibility for a setback at work.",
                "Details": [
                    "What was the task? What was the mistake?",
                    "What pushed you to accept your mistake openly? What was the outcome?",
                    "What did you learn from this experience?"
                ]
            }
        ]
    },
    "planning": {
        "Operational Definition": "The ability to choose the necessary actions to reach a goal, decide the right order, assign each task to the proper cognitive resources, and establish a plan of action.",
        "Potential Strength": {
            "Summary": "Evaluates available options, analyzes relevant information, and makes informed decisions throughout the planning process.",
            "Details": [
                "Skillfully breaks down complex goals to determine the logical order of the tasks.",
                "Prioritizes important tasks and activities that have a substantial impact on the overall objective.",
                "Examines the plan regularly to take corrective action based on progress or to address unforeseen challenges."
            ]
        },
        "Development Considerations": {
            "Summary": "May have difficulty defining specific goals and objectives, resulting in a lack of direction and focus.",
            "Details": [
                "Struggles in determining time, effort, or availability of resources while planning.",
                "Is reluctant to modify one's plan in light of changing circumstances.",
                "Tends to overlook the interdependencies or relationships between tasks to create a coherent plan."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you had to develop a contingency plan to address potential obstacles.",
                "Details": [
                    "What was the plan? What were the potential obstacles?",
                    "What steps did you take to create a contingency plan?",
                    "What was the outcome? What did you learn about planning from this?"
                ]
            },
            {
                "Initial": "Describe a time when you had multiple assignments due at once.",
                "Details": [
                    "How did you organize your time to complete the assignments on time?",
                    "Did you face any problems? How did you manage?",
                    "What was the take away from this experience?"
                ]
            }
        ]
    },
    "positive mindset": {
        "Operational Definition": "Demonstration of a 'can-do' attitude and approaching situations in a pleasant, happy, and upbeat manner.",
        "Potential Strength": {
            "Summary": "Maintains an upbeat attitude even under pressure by staying positive.",
            "Details": [
                "Is resilient and quickly recuperates from setbacks or failures.",
                "Celebrates small victories and maintains a can-do attitude.",
                "Uses supportive and inclusive language that uplifts others."
            ]
        },
        "Development Considerations": {
            "Summary": "May depend primarily on external factors to determine one's own happiness.",
            "Details": [
                "May not prioritize self-care which could hinder the maintenance of a positive mindset.",
                "May struggle to recover from setbacks due to a lack of focus on the silver lining.",
                "Has a hard time engaging in positive self-talk to overcome challenges."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time when you remained positive despite personal or professional obstacles.",
                "Details": [
                    "What were some of the obstacles that you encountered?",
                    "What steps did you take to remain positive? Did you seek help?",
                    "What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Describe a time you struggled to remain positive in the face of challenges.",
                "Details": [
                    "What was the challenge that you were facing?",
                    "What made it particularly difficult? Did you do anything to remain positive?",
                    "What was the outcome? What did this outcome teach you about yourself?"
                ]
            }
        ]
    },
    "presentation skills": {
        "Operational Definition": "The ability to confidently deliver an engaging message to a group of people that achieves the objectives.",
        "Potential Strength": {
            "Summary": "Understands how to present a message to the intended audience in an engaging and memorable manner.",
            "Details": [
                "Makes the presentation compelling by using elements of storytelling wherever possible.",
                "Ensures that the presentation achieves its desired objective with the audience as intended.",
                "Establishes the presentation and arranges its contents in a logical and well-organized manner."
            ]
        },
        "Development Considerations": {
            "Summary": "Finds it tough to structure a coherent presentation that achieves its desired objective.",
            "Details": [
                "Experiences difficulty using visual aids to create an engaging presentation.",
                "Has a hard time modifying the contents of the presentation to suit audience requirements.",
                "May struggle to respond clearly to audience members' questions and concerns."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time you tailored a presentation keeping in mind the target audience.",
                "Details": [
                    "Who was the target audience? What were their requirements?",
                    "What steps did you take to modify the presentation?",
                    "What was the outcome? What did you take away from the experience?"
                ]
            },
            {
                "Initial": "Describe a time when you had to present technical or complex information to a non-technical audience.",
                "Details": [
                    "What was the nature of the information?",
                    "How did you present the information? What steps did you take? Did you use visual aids? How did you ensure clarity?",
                    "What was the outcome? How did the audience respond? What were your key takeaways from this experience?"
                ]
            }
        ]
    },
    "project management": {
        "Operational Definition": "The ability to plan and manage projects, activity schedules, resource allocation, time scales, and timelines with associated budgets in order to deliver projects on time, within cost, and at the desired quality level.",
        "Potential Strength": {
            "Summary": "Takes proactive measures to ensure the project is completed on time and to the specified quality standards.",
            "Details": [
                "Ensures stakeholders receive project updates and reports in a timely manner.",
                "Monitors work progress against the set benchmarks to identify and resolve unforeseen problems.",
                "Anticipates potential roadblocks and hurdles and works diligently towards mitigating them."
            ]
        },
        "Development Considerations": {
            "Summary": "Experiences difficulty in delivering projects on time, within budget, and to the specified standards.",
            "Details": [
                "May have a limited understanding of the project management tools and techniques.",
                "Has difficulty tracking project progress and foreseeing obstacles to assure a smooth delivery.",
                "May not prioritize communicating project status updates to stakeholders to keep them informed."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Specify a time when you successfully completed a project under stringent time constraints.",
                "Details": [
                    "What was the project? What were the timelines? Who were the stakeholders?",
                    "What measures did you take? How did you overcome challenges?",
                    "What would you do differently if you could redo the event?"
                ]
            },
            {
                "Initial": "Tell us about a time you identified potential risks in a project and created a backup plan.",
                "Details": [
                    "What project were you working on, and what perceived risks did you recognize?",
                    "How did you identify these potential risks? What specific steps did you take to develop a backup plan?",
                    "What was the outcome? What were your key takeaways from this particular project?"
                ]
            }
        ]
    },
    "promoting a culture of respect": {
        "Operational Definition": "The act of creating and promoting a culture where diversity is valued, where individuals feel that their contributions are recognized and acknowledged, and where expectations regarding behavior are clearly articulated and modeled by leadership.",
        "Potential Strength": {
            "Summary": "Promotes a culture of respect by setting an example and serving as a role model.",
            "Details": [
                "Actively listens to others and fosters an environment where they can freely express their opinions.",
                "Takes corrective action against discriminatory conduct and reinforces behavioral expectations.",
                "Shows genuine appreciation for the skills, knowledge, and efforts of others."
            ]
        },
        "Development Considerations": {
            "Summary": "May have a hard time taking the lead and establishing certain ground rules for workplace behavior.",
            "Details": [
                "May at times behave in a manner that undermines the culture of respect.",
                "Tends to be indifferent to others and struggles to acknowledge the contributions of others at work.",
                "Experiences difficulty in fostering a respectful environment in which everyone's ideas are valued and treated fairly."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time when you addressed disrespectful behavior or remarks in the workplace.",
                "Details": [
                    "What was disrespectful about it?",
                    "How did it affect you or anyone else at work? What steps did you take to deal with it?",
                    "What was the outcome? If you had to do it again, how would you go about it?"
                ]
            },
            {
                "Initial": "Describe a time when you set clear behavioral expectations to foster a respectful work culture.",
                "Details": [
                    "Why did you feel the need to deal with it head-on?",
                    "What steps did you take to set the expectations? How did you communicate them to others?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            }
        ]
    },
    "purpose-driven": {
        "Operational Definition": "An abiding intention to achieve a long-term goal that is both personally meaningful and makes a positive mark on the world.",
        "Potential Strength": {
            "Summary": "Exhibits genuine enthusiasm and steadfast devotion towards the long-term goal that benefits the greater good.",
            "Details": [
                "Effectively adapts one's strategies and finds resources to progress towards one's long-term goal.",
                "Builds partnerships with like-minded individuals or organizations to achieve shared goals.",
                "Remains resilient in the face of obstacles and does not get swayed by distractions."
            ]
        },
        "Development Considerations": {
            "Summary": "Lacks the tenacity to pursue a personally meaningful long-term objective that benefits everyone.",
            "Details": [
                "Often gets distracted and loses sight of long-term goals in the face of challenges and short-term gains.",
                "Prefers to work alone and in isolation on personally significant long-term objectives, minimizing their wider impact.",
                "Seldom celebrates milestones that inspire and nurture long-term aspirations."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a project or initiative you worked on that had a clear objective and created a positive impact.",
                "Details": [
                    "What was the goal you were working towards?",
                    "What made you search for collaborative opportunities? What steps did you take to find them?",
                    "What was the outcome?"
                ]
            },
            {
                "Initial": "Tell us about a time when you went above and beyond the call of duty because it was meaningful to you.",
                "Details": [
                    "What was the activity? Why was it important to you?",
                    "What steps did you take to find and accomplish the activity? Did you face any obstacles?",
                    "What was the outcome? Did you share it with others? What did you learn from this experience?"
                ]
            }
        ]
    },
    "resilience": {
        "Operational Definition": "The courage and emotional strength to withstand adversity and bounce back from difficult life situations.",
        "Potential Strength": {
            "Summary": "Can self-regulate one's emotions, thoughts, and actions and does what needs to be done to bounce back from setbacks.",
            "Details": [
                "Perseveres on one's goals and objectives to deliver results despite facing setbacks.",
                "Finds creative solutions to overcome obstacles as a result of being flexible in one's approach.",
                "Concentrates on one's locus of control to maximize one's chance of success when faced with challenges."
            ]
        },
        "Development Considerations": {
            "Summary": "May exhibit a tendency to withdraw and become pessimistic in the face of adversity or setbacks.",
            "Details": [
                "Takes longer than usual to cope with setbacks as a result of getting overwhelmed.",
                "Tends to lose focus and find it challenging to discern between things under one's control and outside of it to overcome them.",
                "May struggle to practice positive self-talk and end up criticizing and questioning themselves repeatedly."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Can you share a time when you faced resistance, criticism, or failure in a project or initiative you were working on?",
                "Details": [
                    "How did you initially react to the resistance, criticism, or failure? What emotions did you experience?",
                    "How did you stay motivated and maintain your confidence despite the setback?",
                    "Did you make any adjustments to your approach or strategy based on the feedback or lessons learned?"
                ]
            },
            {
                "Initial": "Tell us about a time when you encountered a major setback or failure at work.",
                "Details": [
                    "What was the situation? What was the setback?",
                    "How did you approach the setback? What would you do differently if you had to do it again?",
                    "What did you learn from this experience?"
                ]
            }
        ]
    },
    "role modeling": {
        "Operational Definition": "The act of presenting or behaving in a certain way that is admired, followed, and imitated by others.",
        "Potential Strength": {
            "Summary": "Accepts complete responsibility for one's actions and reflects on the lessons learned to take corrective action.",
            "Details": [
                "Demonstrates exemplary behavior in handling difficult circumstances by remaining calm, composed, and positive.",
                "Adopts a growth mindset and continuously tracks down opportunities to learn.",
                "Builds positive relationships by communicating effectively and respectfully."
            ]
        },
        "Development Considerations": {
            "Summary": "May bother less on demonstrating positive behaviors, values, and actions for others to emulate.",
            "Details": [
                "Exhibits inconsistent work habits and routines, resulting in a lack of dependability or trust.",
                "May disregard the feedback or contributions of others, undermining the collaborative spirit.",
                "Has a tendency to avoid responsibility and assign blame to others."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Can you provide an example of a time when you were a positive role model for others in a professional setting?",
                "Details": [
                    "What specific actions or behaviors did you demonstrate that made you a positive role model in that situation?",
                    "Did you actively seek opportunities to mentor or guide others as part of your role modeling efforts? If so, how did you identify individuals who could benefit from your guidance?",
                    "Did you encourage others to develop their own unique strengths and styles while still embodying positive qualities?"
                ]
            },
            {
                "Initial": "Describe an occasion you intentionally behaved in a manner you wanted others to follow.",
                "Details": [
                    "What were your goals? Why did you want them to embrace these behaviors or values?",
                    "How did you model and promote these values? Did you face any challenges?",
                    "How did your role modeling effect work culture? Did others respond similarly?"
                ]
            }
        ]
    },
    "self-confidence": {
        "Operational Definition": "An attitude that allows individuals to have positive yet realistic views of themselves and their situations.",
        "Potential Strength": {
            "Summary": "Confidently expresses one's thoughts and opinions to establish boundaries and facilitate meaningful interactions.",
            "Details": [
                "Uses one's belief in one's abilities to propel forward in times of difficulty.",
                "Pursues higher accomplishments due to the enhanced focus and concentration that stems from one's belief in one's abilities.",
                "Maintains one's level of motivation during difficult times and high-pressure situations due to confidence in one's capabilities."
            ]
        },
        "Development Considerations": {
            "Summary": "Tends to have limiting beliefs about one's capabilities due to self-doubt.",
            "Details": [
                "May easily get overwhelmed and withhold one's ideas and opinions in high-pressure situations.",
                "Finds it hard to foster new relationships due to the lack of conviction in one's interactions.",
                "Gets overly focused on failures and experiences a profound impact on one's self-image."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time you were asked to complete a task you weren't sure you could complete.",
                "Details": [
                    "What was the task? Why were you unsure?",
                    "How did you approach the situation?",
                    "What was the outcome? What did you learn from that experience?"
                ]
            },
            {
                "Initial": "Describe a time when your confidence helped you accomplish something.",
                "Details": [
                    "What was the task? Why were you confident that you will be able to achieve it?",
                    "What was the outcome? What role did your belief in yourself play in the outcome?",
                    "What did you take away from this experience?"
                ]
            }
        ]
    },
    "self-control and regulation": {
        "Operational Definition": "The ability to regulate one's emotions, thoughts, and behavior while inhibiting or giving in to temptations and impulses.",
        "Potential Strength": {
            "Summary": "Manages one's emotions and reactions appropriately by demonstrating self-awareness.",
            "Details": [
                "Resists impulsive behavior and acts deliberately by taking the long-term consequences into account.",
                "Regularly evaluates and evaluates one's thoughts, emotions, and behaviors in order to exercise self-control.",
                "Maintains healthy boundaries to manage one's time and avoid exhaustion."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a tendency to act impulsively without fully considering the implications of one's actions.",
            "Details": [
                "Has a basic understanding of how to deal with pent-up or unresolved emotions to avoid outbursts.",
                "Lacks the willingness to explore the root causes of emotional triggers to address one's emotional challenges.",
                "May struggle to understand the context of one's emotional experiences, making them harder to manage."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe the last time you dealt with a difficult client or a colleague.",
                "Details": [
                    "What was the person difficult to deal with?",
                    "How did you approach the situation? What steps did you take? Did you seek help?",
                    "What was the outcome? What did this experience teach you?"
                ]
            },
            {
                "Initial": "Describe the last time it was difficult for you to control your emotions.",
                "Details": [
                    "What was the situation? Why was managing your emotions difficult?",
                    "What emotions did you find hard to handle? Did you manage to keep them in check?",
                    "What was the outcome? What did it teach you about your emotional triggers?"
                ]
            }
        ]
    },
    "self-directedness": {
        "Operational Definition": "The ability to regulate and adapt behavior to the demands of a situation in order to achieve personally chosen goals and values.",
        "Potential Strength": {
            "Summary": "Takes full responsibility for reaching one's goals, regardless of external circumstances.",
            "Details": [
                "Exhibits a keen awareness of the situation and uses it to guide one's behavior.",
                "Makes smart decisions based on analysis, research, and evaluation to reach one's goals.",
                "Adapts to situational demands and actively looks for ways to reach one's goals."
            ]
        },
        "Development Considerations": {
            "Summary": "Experiences difficulty adapting one's approach to different situations to achieve one's goals.",
            "Details": [
                "May lack the motivation to persevere through different situational demands to reach one's goals.",
                "Has a hard time adapting to change and becomes overwhelmed by the fluctuating demands of the situation.",
                "Frequently lacks clarity on one's goals, making it difficult to deal with challenging situations."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you had to adapt your approach to your goal due to changing circumstances.",
                "Details": [
                    "What was the goal? What was the change? What were the changes you had to make to adapt?",
                    "What steps did you take? Did you face any obstacles?",
                    "What was the outcome? What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Tell us about a time when you abandoned a personal goal due to changing circumstances.",
                "Details": [
                    "What was the goal? Why did you feel the need to abandon it?",
                    "Did you take any steps to salvage the goal? Did you seek help? Do you wish you had continued working on your goal?",
                    "What did you take away from this experience?"
                ]
            }
        ]
    },
    "self-motivation": {
        "Operational Definition": "The sense of internal drive or state that pushes a person to achieve, produce, develop, and keep moving forward.",
        "Potential Strength": {
            "Summary": "Is persistent, determined, and resilient in the pursuit of their goals.",
            "Details": [
                "Possesses an unwavering drive to succeed, even in the face of challenges or obstacles.",
                "Rather than waiting for others to direct or motivate, takes ownership of one's actions and outcomes.",
                "Sets clear, meaningful goals and work persistently towards achieving them."
            ]
        },
        "Development Considerations": {
            "Summary": "Struggles to uncover and maintain motivation and passion for one's goals and objectives.",
            "Details": [
                "May become easily disheartened by setbacks and experience a loss of motivation.",
                "May not consider establishing a system of self-reward for making progress.",
                "Has a hard time to keep oneself motivated in new situations."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a project or task you worked on with a lot of enthusiasm.",
                "Details": [
                    "What was the project? What aspects of the project sparked your enthusiasm or passion?",
                    "Did you face any obstacles while working on the project? Did they have any effect on your enthusiasm?",
                    "Did your enthusiasm make a difference? What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Tell me about a time when you faced a challenging goal or project.",
                "Details": [
                    "What was the task? Why did you find it particularly challenging?",
                    "Did you complete it? How did you keep yourself motivated? What worked? What didn't?",
                    "What did you learn from this experience about yourself?"
                ]
            }
        ]
    },
    "speaking with conviction": {
        "Operational Definition": "The ability to transfer information to and from others in an intentional, influential, and honest way where everyone feels heard and objectives of the conversation are met.",
        "Potential Strength": {
            "Summary": "Maintains one's focus on the intended goals and outcomes while communicating with others.",
            "Details": [
                "Adapts one's communication style by displaying empathy for others and considering their points of view.",
                "Takes nonverbal cues into account to boost the message's impact and effectiveness.",
                "Strives to enhance one's ability to transfer information by incorporating and soliciting feedback."
            ]
        },
        "Development Considerations": {
            "Summary": "Struggles to articulate ideas and concepts clearly, resulting in an ineffective information transfer.",
            "Details": [
                "Finds it hard to adapt one's communication style to suit the requirements of the audience.",
                "May have little interest in ensuring that the conversation's objectives are met.",
                "May lack self-confidence, making it difficult to transfer the information effectively."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell me about a time when you had to present a new idea or proposal to a group of skeptical stakeholders.",
                "Details": [
                    "What were the main concerns or reasons behind the skepticism of the stakeholders? How did you identify and understand those concerns?",
                    "Did you use any data, research, or evidence to support your idea or proposal? How did you incorporate it into your presentation to build credibility and overcome skepticism?",
                    "How did you gauge the reactions and engagement of the skeptical stakeholders during the presentation? Did you make any adjustments or adapt your approach based on their responses?"
                ]
            },
            {
                "Initial": "Can you share an example of a time when you had to communicate complex information or technical details to a non-technical audience?",
                "Details": [
                    "How did you determine the level of understanding and background knowledge of the non-technical audience before communicating the information?",
                    "How did you ensure that the non-technical audience remained engaged and interested throughout the communication process?",
                    "Did you make any adjustments or adaptations in your communication approach based on the feedback or reactions from the non-technical audience? If so, what changes did you make and why?"
                ]
            }
        ]
    },
    "storytelling": {
        "Operational Definition": "The ability to identify, listen to, tell, understand, be touched by, and act on the stories that one is exposed to.",
        "Potential Strength": {
            "Summary": "Condenses data findings into a clear, compact, and easy-to-understand story.",
            "Details": [
                "Creates a distinct narrative that ensures the story proceeds logically and connects with the audience.",
                "Adapts the narrative approach based on the needs of the targeted audience.",
                "Utilizes data visualization to present information in a captivating manner."
            ]
        },
        "Development Considerations": {
            "Summary": "May prioritize data and facts and find it difficult to infuse emotions into data-driven storylines.",
            "Details": [
                "May have a limited understanding of how to translate data points into a coherent and compelling narrative.",
                "Experiences difficulty in using data visualization techniques to enhance the storytelling experience.",
                "Finds it tough to modify storytelling approaches to cater to the needs of the target audience."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you used data to create a compelling story or narrative.",
                "Details": [
                    "What was the goal? What kind of data were you working with?",
                    "What steps did you take to build your narrative? How did you tailor the narrative to the target audience? Did you encounter any challenges?",
                    "What was the outcome? What lessons did you learn from this? What could you have done better?"
                ]
            },
            {
                "Initial": "Tell us about a situation where you used storytelling to inspire action or motivate others.",
                "Details": [
                    "What was the situation? What was the outcome you were aiming for?",
                    "Did you take any special steps to inspire that particular action?",
                    "What was the outcome?"
                ]
            }
        ]
    },
    "strategic thinking": {
        "Operational Definition": "The ability to formulate objectives and priorities, and implement plans consistent with the long-term interests of the organization in a global environment.",
        "Potential Strength": {
            "Summary": "Actively thinks about emerging trends and how they might affect the long-term goals of the organization.",
            "Details": [
                "Puts in structures to lessen the impact of the organization's limitations on the long-term goals of the organization.",
                "Aligns initiatives with the long-term objectives of the organization by rallying stakeholders and reaching a consensus.",
                "Looks for growth and partnership opportunities that fit with the long-term goals of the organization."
            ]
        },
        "Development Considerations": {
            "Summary": "May prioritize quick results over long-term strategic objectives, thereby curtailing sustainable growth and competitive advantage.",
            "Details": [
                "Has a hard time aligning plans and actions with the long-term interests and strategic direction of the organization, which often leads to a lack of alignment.",
                "Exhibits difficulty adapting strategies and plans in a timely manner to changing circumstances or unforeseen challenges.",
                "Overlooks the importance of seeking perspectives of stakeholders, which may limit understanding and create blind spots."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Describe a time when you had to change a strategic plan because of a change in circumstances.",
                "Details": [
                    "What was the plan? What pushed you to change the plan?",
                    "Did you have a contingency plan in place? What steps did you take? What obstacles did you face? Was the new plan well-received?",
                    "What did this experience teach you?"
                ]
            },
            {
                "Initial": "Share an example of a strategic plan that you created and successfully put into action.",
                "Details": [
                    "What was the objective or purpose of the strategic plan?",
                    "What steps did you take to develop the plan? How did you acquire support for your plan? Did you encounter any obstacles during the implementation phase?",
                    "What lessons did you learn from this experience?"
                ]
            }
        ]
    },
    "synthesizing messages": {
        "Operational Definition": "The ability to synthesize thoughts and information to discover or extend understandings.",
        "Potential Strength": {
            "Summary": "Extracts meaningful insights by effectively analyzing complex thoughts and information.",
            "Details": [
                "Quickly assimilates information and recognizes the connections and interdependencies.",
                "Finds the overarching themes while analyzing thoughts and information.",
                "Proactively identifies and bridges the gaps in understanding by filling in the missing information."
            ]
        },
        "Development Considerations": {
            "Summary": "May lack the skills and motivation to derive meaningful insights from the information.",
            "Details": [
                "Finds it tough to communicate the gathered insights in a clear and concise manner.",
                "Lacks the ability to accurately assess the reliability and significance of different sources of information.",
                "Often overlooks crucial details, common threads, and nuances in the information."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time you had to combine information from various sources to understand a complex topic.",
                "Details": [
                    "What was the topic? Why did you have to consult multiple sources?",
                    "How did you approach it? How did you ensure that you captured all the relevant information? Did you encounter any difficulties?",
                    "What did you take away from this experience?"
                ]
            },
            {
                "Initial": "Give an example of a time when it was hard for you to make sense of complex information or ideas",
                "Details": [
                    "What made it difficult for you to understand the topic?",
                    "What methods or strategies did you use? What were the main challenges or obstacles you encountered? Did you seek any additional support?",
                    "What was the outcome? What did you learn from this experience?"
                ]
            }
        ]
    },
    "time management and prioritization": {
        "Operational Definition": "The ability to use ones time effectively and productively, and prioritize tasks efficiently in order to manage one's time.",
        "Potential Strength": {
            "Summary": "Allocates sufficient time for each task, organizes one's work, and makes progress towards completing assignments within the given time frame.",
            "Details": [
                "Breaks down larger projects into manageable chunks and establishing clear timelines.",
                "Skillfully adjusts and deprioritizes tasks and timelines based on situational demands.",
                "Is disciplined, adheres to schedule, and promptly works on tasks instead of procrastinating."
            ]
        },
        "Development Considerations": {
            "Summary": "Tends to miss deadlines and falls behind schedule as a result of underestimating the time taken to complete the task.",
            "Details": [
                "Needs to work on how to deprioritize tasks based on situational demands to meet key deadlines.",
                "May struggle to understand the difference between urgent and important tasks.",
                "Find it tough to stay focused on the task at hand and get distracted with other work activities like email."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Share the last time you were behind your work schedule and missed a deadline.",
                "Details": [
                    "Why were you behind schedule? What happened?",
                    "What was the outcome of missing the deadline?",
                    "What did you take away from the experience?"
                ]
            },
            {
                "Initial": "Can you describe a time you dealt with a time-sensitive task?",
                "Details": [
                    "What was the task? How did you plan for the task?",
                    "Were you able to complete the task? if yes, what steps did you take to ensure that the task gets completed on time?",
                    "What was the outcome?"
                ]
            }
        ]
    },
    "unconventional approach (breaking stereotypes and barriers)": {
        "Operational Definition": "A generalized belief to work beyond the stereotypes of gender or creed and openly accept differing perspectives.",
        "Potential Strength": {
            "Summary": "Is prepared to change one's opinions and beliefs in light of new information.",
            "Details": [
                "Fosters an environment where everyone feels welcome and valued.",
                "Exhibits genuine curiosity in understanding others' unconventional thoughts and beliefs.",
                "Promotes the eradication of stereotypes and biases by taking deliberate measures to eliminate them."
            ]
        },
        "Development Considerations": {
            "Summary": "Is rigid and unwilling to change one's perspective, even in the light of new information.",
            "Details": [
                "Often dismisses initiatives that challenge biases and stereotypes at the workplace.",
                "Has a tendency to be argumentative when faced with conflicting points of view.",
                "May have a limited understanding of unconscious biases and how they reflect in one's behavior."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Share an occasion in which you successfully challenged your own preconceived notions.",
                "Details": [
                    "Can you articulate your earlier belief? What made you question your first belief?",
                    "How did you question your beliefs? What challenges did you face? How did you get through it?",
                    "What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Describe a time when you actively fought against prejudice or stereotype.",
                "Details": [
                    "What was the prejudice or stereotype? Why did you find the need to fight against it?",
                    "How did you approach the situation? Did you face any challenges? How did you deal with them?",
                    "What was the outcome? What did this experience teach you?"
                ]
            }
        ]
    },
    "understanding of the external environment": {
        "Operational Definition": "The ability to have a good understanding and judgment about a group of factors or conditions that are outside the organization but affect it to some extent.",
        "Potential Strength": {
            "Summary": "Stays updated on the various external business environments like technology that could potentially impact the organization.",
            "Details": [
                "Proactively conducts an analysis to evaluate the extent of the impact external factors could have on the organization.",
                "Adapts strategies and approaches to minimize the impact of the external business environment on the organization.",
                "Adopts a strategic approach and aligns organizational goals and objectives with external business conditions."
            ]
        },
        "Development Considerations": {
            "Summary": "Often undermines the impact of the external business environment on the organization.",
            "Details": [
                "Lacks clarity about the external business environment and takes a reactive approach that could potentially alter the organization's competitiveness.",
                "Experiences difficulty staying updated on emerging trends and tends to rely on outdated or incomplete information.",
                "May avoid taking calculated risks based on one's experience to adapt and respond to changes in the external business environment."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a strategic choice you made based on your understanding of the external market conditions.",
                "Details": [
                    "What was the choice that you made? What pushed you to make that choice?",
                    "What factors did you consider while making that choice? How did you evaluate the external market conditions?",
                    "What was the outcome? What are the key lessons you learned from this experience?"
                ]
            },
            {
                "Initial": "Tell us about a situation where you identified a potential threat or disruption in the external environment.",
                "Details": [
                    "What was the disruption or threat you identified? How did you find out about this?",
                    "How did you analyze the impact of it? How did you validate your understanding?",
                    "What was the outcome? What did you learn from this experience?"
                ]
            }
        ]
    },
    "understanding one's emotions": {
        "Operational Definition": "The ability to recognize and accept one's feelings and emotions as they occur.",
        "Potential Strength": {
            "Summary": "Takes full responsibility for one's emotions and proactively regulates them.",
            "Details": [
                "Can correctly identify and label one's emotions.",
                "Understands how one's emotions influence one's behavior.",
                "Understands how others may perceive one's emotions."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a hard time understanding how one's emotions affect one's behavior.",
            "Details": [
                "Tends to dismiss one's emotions and may have difficulty naming them.",
                "Has a limited understanding of how to manage one's emotions in a healthy manner.",
                "May not have much clarity on one's emotional triggers and underlying causes."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Give an example of a time when you had difficulty managing your emotions.",
                "Details": [
                    "What was the situation? What was the emotion you were experiencing?",
                    "Why did it seem hard to handle? How did you attempt to manage how you felt? Did you ask for help?",
                    "What lessons did you learn from this? What would you do differently if you could redo this?"
                ]
            },
            {
                "Initial": "Tell us about the last time something made you experience a strong emotion in public.",
                "Details": [
                    "What triggered such a strong emotion?",
                    "How did you manage your emotions? Did you take any specific steps?",
                    "Did you reflect on your emotional response? What would you do differently if you could redo this?"
                ]
            }
        ]
    },
    "understanding one's strengths": {
        "Operational Definition": "The ability to reflect on, consider, and identify one's core strengths to utilize them for particular ways of thinking, feeling, and behaving.",
        "Potential Strength": {
            "Summary": "Effectively utilizes one's strengths to enhance one's performance and productivity.",
            "Details": [
                "Actively seeks feedback to gain insights into one's strengths for further development.",
                "Can articulate one's core skills and specific contributions in different aspects of life.",
                "Pursues opportunities in areas that complement one's core strengths."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a limited understanding of one's strengths and how to utilize them.",
            "Details": [
                "May not focus on identifying areas that complement one's strengths to expand one's area of expertise.",
                "Focuses primarily on overcoming shortcomings rather than discovering and maximizing strengths.",
                "Tends to disregard feedback on one's core strength and limits their development in the process."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us the last time you used your core strength at work.",
                "Details": [
                    "What is your core strength?",
                    "Where did you use it and how? In such a situation, how did it help you?",
                    "Did this situation help you learn more about your core strength? What did you learn?"
                ]
            },
            {
                "Initial": "Tell us about a time when you received feedback on your core strengths.",
                "Details": [
                    "What is your core strength?",
                    "What was the feedback? Did you agree with it?",
                    "Did it help you? What did you learn from it?"
                ]
            }
        ]
    },
    "vision alignment": {
        "Operational Definition": "The act of ensuring that every working member of the team or the organization understands the strategies and work required to turn the vision into reality along with their contribution to the same.",
        "Potential Strength": {
            "Summary": "Ensures that everyone has an in-depth understanding of the vision and the strategy to achieve it.",
            "Details": [
                "Regularly provides updates on the progress to keep everyone motivated.",
                "Encourages dialogue and answers queries and concerns to develop shared understanding.",
                "Finds opportunities to reinforce the connection between individual efforts and the overall vision."
            ]
        },
        "Development Considerations": {
            "Summary": "Has a tough time reinforcing the link between individual work and the overall vision.",
            "Details": [
                "Tends to provide updates only when essential, which may result in misalignment",
                "Struggles to answer others' queries and concerns regarding the work required to achieve the vision.",
                "Often struggles to effectively communicate the vision and strategy, leaving others perplexed."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time when you had to change strategies or plans because the organization's vision had changed.",
                "Details": [
                    "What changed in the organization's vision?",
                    "How did you approach the change? What steps did you take to ensure alignment? How did you gain buy-in from others?",
                    "Did you monitor the outcomes? What did you learn from this experience?"
                ]
            },
            {
                "Initial": "Tell us about a time when you made sure your team understood your vision and strategies.",
                "Details": [
                    "What was the vision? What was the strategy?",
                    "How did you approach the task? Did you face any challenges? Did you receive any feedback?",
                    "What was the outcome? What did you take away from this experience?"
                ]
            }
        ]
    },
    "voice, articulation, and diction": {
        "Operational Definition": "The ability to clearly speak with confidence, appropriate voice modulation, pitch, pauses, and energy.",
        "Potential Strength": {
            "Summary": "Speaks consciously to ensure that each word is audible and understood.",
            "Details": [
                "Uses the right tone of voice to show emotions and highlight key details.",
                "Makes effective use of strategic pauses to give the audience time to process the information.",
                "Matches the tone of voice to suit the content and its desired impact."
            ]
        },
        "Development Considerations": {
            "Summary": "Often exhibits poor diction and pronunciation that leads to misunderstandings.",
            "Details": [
                "Tends to speak in a tone of voice that struggles to command attention from the audience.",
                "May struggle to speak deliberately to allow comprehension and engagement.",
                "Has a hard time using pauses to enhance the desired impact."
            ]
        },
        "Interview Questions": [
            {
                "Initial": "Tell us about a time you received feedback on your speaking skills.",
                "Details": [
                    "What was the feedback?",
                    "What was the focus of the feedback? Did you take any steps to deal with it?",
                    "Did you find the feedback useful? What change did it bring in your speaking skills?"
                ]
            },
            {
                "Initial": "Describe a time when you successfully adapted your tone and intonation to meet the needs of your audience.",
                "Details": [
                    "What was the situation? What were the requirements?",
                    "What specific adjustments did you make? Did you face any challenges? How did you handle them?",
                    "What was the end result? Have you used this experience's lessons elsewhere?"
                ]
            }
        ]
    }
}